import { removeToken } from '../utils/auth';

const errMsg = {
  'E0000': '系统内部错误',
  'E0110': '平台未启用',
  'E2000': '有必填项未填',
  'E2001': '唯一性检查错误',
  'E2002': '有效性检查错误',
  'E2003': '无效值检查错误',
  'E2004': '类型检查错误',
  'E2005': '未查询到数据',
  'E3100': '声连码已停用',
  'E3101': '声连码授权已过期',
  'E3102': '声连码数量超过限制',
  'E3135': '声连码名称不符合规范',
  'E3200': '推送状态已停用',
  'E3201': '无推送内容',
  'E3202': '声连码已使用在其他推送配置',
  'E3244': '重复操作推送状态，请刷新后查看最新状态',
  'E3300': '内容状态已停用',
  'E3400': '应用数量超过限制',
  'E3500': '应用已停用',
  'E10001': '未经过授权',
  'E10003': '无权限访问',
  'E10100': '无法识别客户端',
  'E10101': '客户端ID不存在',
  'E10102': '客户端Key/Secret错误',
  'E10103': '无法获取AccessToken',
  'E3800': '代理商客户不存在',
  'E3801': '代理商客户账号已存在',
  'E3802': '代理商已存在',
  'E3803': '代理商状态无效',
  'E3804': '代理商已过期',
  'E3805': '代理商不存在',
  'E3806': '合同不存在',
  'E3807': '代理商更新失败',
  'E3808': '无法设置代理商管理员',
  'U000': '网络错误请刷新页面重试',
  'U10001': '账号或密码错误',
  'U10002': '原密码错误，请重新输入'
};
const errDelete = {
  'E3000': '平台未授权',
  'E3001': '平台已停用',
  'E3002': '平台授权已过期',
  'E3700': '客户已停用'
};
export function errCodeMsg(err, _this) {
  const errCode = err.error.errCode;
  if (errDelete[errCode]) {
    removeToken();
    _this.$router.push('login');
    return _this.$message.error(errDelete[errCode]);
  } else {
    const errInfo = errMsg[errCode] || '恭喜您触发了未知错误，请刷新页面重试';
    return _this.$message.error(errInfo);
  }
}
